src/Data/mongoDB/mongoDB.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: mongoDB
#+OPTIONS: num:nil H:2

* Install on Ubuntu[fn:1]
MongoDB only provides packages for 64-bit long-term support Ubuntu
releases. Currently, this means 12.04 LTS (Precise Pangolin) and 14.04
LTS (Trusty Tahr).

#+begin_src sh
sudo apt-key adv --keyserver hkp://keyserver.ubuntu.com:80 --recv EA312927
# Ubuntu 12.04
echo "deb http://repo.mongodb.org/apt/ubuntu precise/mongodb-org/3.2 multiverse" | sudo tee /etc/apt/sources.list.d/mongodb-org-3.2.list
# Ubuntu 14.04
echo "deb http://repo.mongodb.org/apt/ubuntu trusty/mongodb-org/3.2 multiverse" 

sudo apt-get update
sudo apt-get install -y mongodb-org
sudo service mongod start
#+end_src

* cc


#+begin_src c++

#+end_src


#+begin_src sh

#+end_src

* Footnotes

[fn:1] https://docs.mongodb.com/manual/tutorial/install-mongodb-on-ubuntu/

