public_html/Data/mongoDB/mongoDB.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mongoDB</title>
<!-- 2016-06-05 Sun 22:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">mongoDB</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Install on Ubuntu</a></li>
<li><a href="#sec-2">cc</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Install on Ubuntu<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-1">
<p>
MongoDB only provides packages for 64-bit long-term support Ubuntu
releases. Currently, this means 12.04 LTS (Precise Pangolin) and 14.04
LTS (Trusty Tahr).
</p>

<div class="org-src-container">

<pre class="src src-sh">sudo apt-key adv --keyserver hkp://keyserver.ubuntu.com:80 --recv EA312927
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Ubuntu 12.04</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"deb http://repo.mongodb.org/apt/ubuntu precise/mongodb-org/3.2 multiverse"</span> | sudo tee /etc/apt/sources.list.d/mongodb-org-3.2.list
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">Ubuntu 14.04</span>
<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"deb http://repo.mongodb.org/apt/ubuntu trusty/mongodb-org/3.2 multiverse"</span> 

sudo apt-get update
sudo apt-get install -y mongodb-org
sudo service mongod start
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">cc</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-c++"></pre>
</div>


<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="https://docs.mongodb.com/manual/tutorial/install-mongodb-on-ubuntu/">https://docs.mongodb.com/manual/tutorial/install-mongodb-on-ubuntu/</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2016-06-05 Sun 22:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
